# Data frames:
 - it is two diamensional data structure
 - for creating data frames we have few names
     - using arrays
     - using list
     - Series
     - dict

In [12]:
import numpy as np
import pandas as pd

In [13]:
arr = np.arange(1,5)
arr

array([1, 2, 3, 4])

In [14]:
df = pd.DataFrame(arr)
df

   0
0  1
1  2
2  3
3  4

In [15]:
names = ['gokul','raju','ravi']
rollnos=[500,501,502]
df1 = pd.DataFrame(names)
df1["name"]=rollnos
df1

       0  name
0  gokul   500
1   raju   501
2   ravi   502

In [16]:
sr = pd.Series(names)
sr

0    gokul
1     raju
2     ravi
dtype: object

In [22]:
df3 = pd.DataFrame(sr)
df3

       0
0  gokul
1   raju
2   ravi

In [23]:
d1=dict(zip(names,rollnos))
d1

{'gokul': 500, 'raju': 501, 'ravi': 502}

In [24]:
d2 = {'Names':names,'Rollnos':rollnos} 
d2

{'Names': ['gokul', 'raju', 'ravi'], 'Rollnos': [500, 501, 502]}

In [25]:
dframe = pd.DataFrame(d2)
dframe

   Names  Rollnos
0  gokul      500
1   raju      501
2   ravi      502

In [26]:
dframe.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
dframe.columns

Index(['Names', 'Rollnos'], dtype='object')

In [28]:
df1 = pd.DataFrame(d2,index=[1,2,3])
df1

   Names  Rollnos
1  gokul      500
2   raju      501
3   ravi      502

In [29]:
srnames = pd.Series(names)
srrollnos =pd.Series(rollnos)
srnames,srrollnos

(0    gokul
 1     raju
 2     ravi
 dtype: object,
 0    500
 1    501
 2    502
 dtype: int64)

In [30]:
df4=pd.DataFrame({'names':srnames,'rollnos':srrollnos})
df4

   names  rollnos
0  gokul      500
1   raju      501
2   ravi      502

In [33]:
df4['names']

0    gokul
1     raju
2     ravi
Name: names, dtype: object

In [37]:
df4['rollnos']

0    500
1    501
2    502
Name: rollnos, dtype: int64

In [40]:
df4['rollnos'][1]

501

In [41]:
df4['rollnos'][1:]

1    501
2    502
Name: rollnos, dtype: int64

In [42]:
df4.loc[0]

names      gokul
rollnos      500
Name: 0, dtype: object

In [34]:
df4.iloc[1]

names      raju
rollnos     501
Name: 1, dtype: object

In [35]:
df4

   names  rollnos
0  gokul      500
1   raju      501
2   ravi      502

In [36]:
df4['branch']=['cse','ece','eee']

In [37]:
df4

   names  rollnos branch
0  gokul      500    cse
1   raju      501    ece
2   ravi      502    eee

In [51]:
df1 = df4.set_index('names')
df1

       rollnos branch
names
gokul      500    cse
raju       501    ece
ravi       502    eee

In [52]:
df1.index

Index(['gokul', 'raju', 'ravi'], dtype='object', name='names')

In [53]:
df1['branch']

names
gokul    cse
raju     ece
ravi     eee
Name: branch, dtype: object

In [54]:
df1.loc['gokul']

rollnos    500
branch     cse
Name: gokul, dtype: object

In [59]:
df1.iloc[1]

rollnos    501
branch     ece
Name: raju, dtype: object

In [61]:
df1.iloc[[0,2]]

       rollnos branch
names
gokul      500    cse
ravi       502    eee

In [62]:
df1['scholarship']=[700,600,500]

In [63]:
df1

       rollnos branch  scholarship
names
gokul      500    cse          700
raju       501    ece          600
ravi       502    eee          500

In [67]:
df1['scholarship'].max()

700

In [68]:
df1['scholarship'].sum()

1800

In [69]:
df1['scholarship'].min()

500

In [70]:
df1['scholarship'].std()

100.0

In [71]:
df1['scholarship'].var()

10000.0

In [72]:
df1.tail(2)['scholarship'].sum()

1100

In [75]:
names=['gokul','nithish','ravi','rishi']
rollno=[100,101,102,103]
pythonmarks=[75,85,96,100]
javamarks=[56,45,69,85]
cmarks=[56,96,75,68]
dg=dict({'Names':names,'Rollno':rollno,'python':pythonmarks,'java':javamarks,'c':cmarks})
gh=pd.DataFrame(dg)
gh

     Names  Rollno  python  java   c
0    gokul     100      75    56  56
1  nithish     101      85    45  96
2     ravi     102      96    69  75
3    rishi     103     100    85  68

In [76]:
f=gh.set_index('Rollno')
f

          Names  python  java   c
Rollno
100       gokul      75    56  56
101     nithish      85    45  96
102        ravi      96    69  75
103       rishi     100    85  68

In [81]:
f['Totalscores']=f[['python','java','c']].sum()

In [83]:
for i in range(len(f.index)):

SyntaxError: invalid syntax (<ipython-input-83-d2152ccdb48a>, line 1)